Repository: ClinIQ-MedAI/cliniq-backend
Catalog: Clinic.Authentication/Localization/Messages.*.resx
Languages: ar

source: User not found
ar: المستخدم غير موجود

# InvalidCredentials
source: Invalid email or password
ar: البريد الإلكتروني أو كلمة المرور غير صحيحة

# NotVerified
source: Please verify your email or phone before logging in
ar: يرجى تأكيد البريد الإلكتروني أو رقم الهاتف قبل تسجيل الدخول

# InvalidLoginRequest
source: Invalid login request - provide password or OTP
ar: طلب تسجيل دخول غير صالح - يرجى تقديم كلمة المرور أو رمز التحقق

# RegistrationSuccess
source: Registration successful. Please verify your email or phone to proceed.
ar: تم التسجيل بنجاح. يرجى تأكيد البريد الإلكتروني أو رقم الهاتف للمتابعة.

# EmailVerifiedSuccess
source: Email verified successfully. You can now login.
ar: تم تأكيد البريد الإلكتروني بنجاح. يمكنك الآن تسجيل الدخول.

# PhoneVerifiedSuccess
source: Phone verified successfully. You can now login.
ar: تم تأكيد رقم الهاتف بنجاح. يمكنك الآن تسجيل الدخول.

source: OTP sent to email.
ar: تم إرسال رمز التحقق إلى البريد الإلكتروني.

source: OTP sent to phone.
ar: تم إرسال رمز التحقق إلى الهاتف.

# ForgotPasswordSent
source: If the email exists, a password reset link has been sent.
ar: إذا كان البريد الإلكتروني موجودًا، فقد تم إرسال رابط إعادة تعيين كلمة المرور.

# PasswordResetSuccess
source: Password reset successfully.
ar: تم إعادة تعيين كلمة المرور بنجاح.

# LoginOtpSent
source: OTP sent to email for login.
ar: تم إرسال رمز التحقق إلى البريد الإلكتروني لتسجيل الدخول.
